---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarSystemActiveBottomDir1Generic
source: html/28e66ed8-4791-cb71-b167-082a1738a9f0.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarSystemActiveBottomDir1Generic Property

"Bottom/Interior Major Direction"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarSystemActiveBottomDir1Generic { get; }
```